Конвертация_данных_31_демо.Conversion_3_Plus/src/InformationRegisters/Расш1_ТекстыМодулей/Расш1_ТекстыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_ТекстыМодулей</name>
  <comment>Тексты модулей релиза для подсказок консоли</comment>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Глобальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.Расш1_ВидыМодулей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/Конвертации/Конвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e18d9381-4a28-46d8-a92d-755ca9a89e17">
  <name>Конвертации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ab625cb8-9910-471e-bc05-af745239a524">
    <name>АлгоритмПередКонвертацией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cec9f551-422e-49b6-9aaf-78d152e0f2b4">
    <name>АлгоритмПослеКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f373551-bb85-4df7-a32c-be8e291d677a">
    <name>АлгоритмПередОтложеннымЗаполнением</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="556f7b1b-7ec2-419c-929a-e59038bc17c2">
    <name>Параметры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c0eb5fda-ed27-4366-9c8b-06c9508127ec">
      <name>Параметр</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/ПравилаКонвертацииОбъектов/ПравилаКонвертацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ccc4d401-cf65-42ba-a49b-6d263a9418f3">
  <name>ПравилаКонвертацииОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f1f62a01-56e3-4583-8adf-42062a4f75ba">
    <name>АлгоритмПриОтправкеДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7bf36c2-d984-460b-bb9f-ccac70f0fbf3">
    <name>АлгоритмПередПолучениемДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="611715e8-ad0b-4e80-b9ce-e189dccd659c">
    <name>АлгоритмПриПолученииДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bdfaa804-67b1-4e54-9b00-4d0163b3c989">
    <name>ИспользоватьДляОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fb0c400-be9d-4bee-a175-cb70fc8dbc00">
    <name>ОбъектФормата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82a6f92f-f001-4eb9-8f74-3a1a128dca75">
    <name>ИспользоватьДляПолучения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b962198b-08f3-43fe-ac2d-ac0b43ac5d2d">
    <name>ОбъектКонфигурации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b258677e-eb48-42e6-806c-ae7c1b743931">
    <name>ОбъектКонфигурацииКорреспондент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/ПравилаОбработкиДанных/ПравилаОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bb5d921b-2c70-4b47-b20b-1d57baa6d783">
  <name>ПравилаОбработкиДанных</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ff155a25-05a1-4518-a002-f43bda1534e0">
    <name>АлгоритмВыборкаДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3ab13827-35bd-4402-8237-ea148c7c3173">
    <name>АлгоритмПриОбработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e893ae0-401d-4eb2-a523-e4dc639cfa43">
    <name>ИспользоватьДляОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c9a0877-0965-49a3-8b43-cf9bd719d7d3">
    <name>ПравилоКонвертацииОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7dc8e495-328d-4d0b-9bc4-e01a70f456b5">
    <name>ИспользоватьДляПолучения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2779952f-ad64-4ce5-9577-b949be432a3f">
    <name>ОбъектВыборки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Конвертация_данных_31_демо.Conversion_3_Plus/src/CommonModules/Расш1_ГлобальныйПоиск/Module.bsl
#Область ПрограммныйИнтерфейс

// Найти вхождения строки в текстах правил, алгоритмов, запросов и модулей конфигурации.
// Места поиска зависят от типа конвертации. Поиск без учета регистра.
// Пустая конвертация и строка короче двух символов дают пустой результат.
//
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации
//  СтрокаПоиска - Строка
//  ИсключитьСсылку - ЛюбаяСсылка, Неопределено - элемент, который не включать в результат
//  ИскатьВМодулях - Булево - искать в текстах модулей релизов конвертации
//  ИскатьВПравилах - Булево - искать в коде правил, алгоритмов и запросов конвертации
//
// Возвращаемое значение:
//  Структура:
//   * Строки - ТаблицаЗначений - колонки Ссылка, Вид, Представление, ИмяПоля, СинонимПоля,
//       НомерСтроки, Фрагмент, ИмяФормы, Источник, ЭтоМодуль, Релиз, ВидМодуля, Ключ
//   * Обрезано - Булево - Истина, если строк больше предела
//
Функция НайтиВхождения(Конвертация, СтрокаПоиска, ИсключитьСсылку = Неопределено, ИскатьВМодулях = Истина, ИскатьВПравилах = Истина) Экспорт
	
	Результат = НовыйРезультатПоиска();
	СтрокаДляПоиска = СокрЛП(СтрокаПоиска);
	Если Не ЗначениеЗаполнено(Конвертация) Или СтрДлина(СтрокаДляПоиска) < 2 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ИскатьВПравилах И Не ИскатьВМодулях Тогда
		Возврат Результат;
	КонецЕсли;
	
	Шаблон = ШаблонПодобия(СтрокаДляПоиска);
	Если ИскатьВПравилах Тогда
		ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация, "ТипКонвертации");
		Для Каждого Источник Из ИсточникиПоиска(ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO) Цикл
			ДополнитьИсточник(Результат, Источник, Конвертация, СтрокаДляПоиска, Шаблон, ИсключитьСсылку);
		КонецЦикла;
	КонецЕсли;
	Если ИскатьВМодулях Тогда
		ДополнитьМодулиКонфигурации(Результат, Конвертация, СтрокаДляПоиска, Шаблон);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПределСтрокРезультата()
	
	Возврат 500;
	
КонецФункции

Функция НовыйРезультатПоиска()
	
	Строки = Новый ТаблицаЗначений;
	Строки.Колонки.Добавить("Ссылка");
	Строки.Колонки.Добавить("Вид", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	Строки.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Строки.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Строки.Колонки.Добавить("СинонимПоля", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	Строки.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный)));
	Строки.Колонки.Добавить("Фрагмент", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(300)));
	Строки.Колонки.Добавить("ИмяФормы", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200)));
	Строки.Колонки.Добавить("Источник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30)));
	Строки.Колонки.Добавить("ЭтоМодуль", Новый ОписаниеТипов("Булево"));
	Строки.Колонки.Добавить("Релиз", Новый ОписаниеТипов("СправочникСсылка.Релизы"));
	Строки.Колонки.Добавить("ВидМодуля", Новый ОписаниеТипов("ПеречислениеСсылка.Расш1_ВидыМодулей"));
	Строки.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	
	Результат = Новый Структура;
	Результат.Вставить("Строки", Строки);
	Результат.Вставить("Обрезано", Ложь);
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьИсточник(Результат, Источник, Конвертация, СтрокаПоиска, Шаблон, ИсключитьСсылку)
	
	Если Результат.Строки.Количество() >= ПределСтрокРезультата() Тогда
		Результат.Обрезано = Истина;
		Возврат;
	КонецЕсли;
	ДополнитьРезультатИсточника(Результат, Источник, Конвертация, СтрокаПоиска, Шаблон, ИсключитьСсылку);
	
КонецПроцедуры

Процедура ДополнитьРезультатИсточника(Результат, Источник, Конвертация, СтрокаПоиска, Шаблон, ИсключитьСсылку)
	
	СсылкаИсключения = Неопределено;
	Если ЗначениеЗаполнено(ИсключитьСсылку)
		И ТипЗнч(ИсключитьСсылку) = ТипСсылкиСправочника(Источник.ИмяСправочника) Тогда
		СсылкаИсключения = ИсключитьСсылку;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаИсточника(
		Источник,
		СсылкаИсключения,
		ПределСтрокРезультата() - Результат.Строки.Количество() + 1);
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Если ЗначениеЗаполнено(СсылкаИсключения) Тогда
		Запрос.УстановитьПараметр("ИсключитьСсылку", СсылкаИсключения);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Результат.Строки.Количество() >= ПределСтрокРезультата() Тогда
			Результат.Обрезано = Истина;
			Прервать;
		КонецЕсли;
		ФрагментСтроки = ФрагментВхождения(Выборка.Текст, СтрокаПоиска);
		СтрокаРезультата = Результат.Строки.Добавить();
		СтрокаРезультата.Ссылка = Выборка.Ссылка;
		СтрокаРезультата.Вид = Источник.Вид;
		СтрокаРезультата.Представление = Выборка.Представление;
		СтрокаРезультата.ИмяПоля = Выборка.ИмяПоля;
		СтрокаРезультата.СинонимПоля = Выборка.СинонимПоля;
		СтрокаРезультата.НомерСтроки = ФрагментСтроки.НомерСтроки;
		СтрокаРезультата.Фрагмент = ФрагментСтроки.Фрагмент;
		СтрокаРезультата.Источник = ПредставлениеИсточникаПравил();
		СтрокаРезультата.ЭтоМодуль = Ложь;
		Если Источник.ЧитатьТипКонвертации Тогда
			СтрокаРезультата.ИмяФормы = ИмяФормыПредопределенных(Выборка.ТипКонвертации);
		ИначеЕсли Источник.ЧитатьЭтоГруппа И Выборка.ЭтоГруппа Тогда
			СтрокаРезультата.ИмяФормы = Источник.ИмяФормыГруппы;
		Иначе
			СтрокаРезультата.ИмяФормы = Источник.ИмяФормы;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаИсточника(Источник, ИсключитьСсылку, ЛимитСтрок)
	
	Части = Новый Массив;
	Для Каждого Поле Из Источник.Поля Цикл
		Части.Добавить(ТекстВыборкиПоля(Источник, Поле, ИсключитьСсылку));
	КонецЦикла;
	
	Колонки =
	"ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Представление КАК Представление,
	|	ВложенныйЗапрос.ИмяПоля КАК ИмяПоля,
	|	ВложенныйЗапрос.СинонимПоля КАК СинонимПоля,
	|	ВложенныйЗапрос.Текст КАК Текст";
	Если Источник.ЧитатьТипКонвертации Тогда
		Колонки = Колонки + ",
	|	ВложенныйЗапрос.ТипКонвертации КАК ТипКонвертации";
	КонецЕсли;
	Если Источник.ЧитатьЭтоГруппа Тогда
		Колонки = Колонки + ",
	|	ВложенныйЗапрос.ЭтоГруппа КАК ЭтоГруппа";
	КонецЕсли;
	
	Возврат
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(ЛимитСтрок, "ЧГ=0") + "
	|	" + Колонки + "
	|ИЗ
	|	(
	|" + СтрСоединить(Части, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС) + "
	|) КАК ВложенныйЗапрос";
	
КонецФункции

Функция ТекстВыборкиПоля(Источник, Поле, ИсключитьСсылку)
	
	Текст = 
	"ВЫБРАТЬ
	|	Элемент.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Элемент.Ссылка) КАК Представление,
	|	""" + Поле.Имя + """ КАК ИмяПоля,
	|	""" + Поле.Синоним + """ КАК СинонимПоля,
	|	Элемент." + Поле.Имя + " КАК Текст";
	Если Источник.ЧитатьТипКонвертации Тогда
		Текст = Текст + ",
	|	Элемент.ТипКонвертации КАК ТипКонвертации";
	КонецЕсли;
	Если Источник.ЧитатьЭтоГруппа Тогда
		Текст = Текст + ",
	|	Элемент.ЭтоГруппа КАК ЭтоГруппа";
	КонецЕсли;
	Текст = Текст + Символы.ПС + ТекстИсточникаИОтбора(Источник, Поле.Имя, ИсключитьСсылку);
	Возврат Текст;
	
КонецФункции

Функция ТекстИсточникаИОтбора(Источник, ИмяПоля, ИсключитьСсылку)
	
	Если Источник.ЭтоКонвертация Тогда
		Текст = 
		"ИЗ
		|	Справочник.Конвертации КАК Элемент
		|ГДЕ
		|	Элемент.Ссылка = &Конвертация";
	ИначеЕсли Источник.ЧерезВладельцаПравила Тогда
		Текст = 
		"ИЗ
		|	Справочник.СоставыКонвертаций КАК Состав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + Источник.ИмяСправочника + " КАК Элемент
		|		ПО Элемент.Владелец = Состав.ЭлементКонвертации
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И ТИПЗНАЧЕНИЯ(Состав.ЭлементКонвертации) = ТИП(Справочник.ПравилаКонвертацииОбъектов)
		|	И НЕ Состав.ПометкаУдаления
		|	И НЕ Элемент.ПометкаУдаления";
		Если Источник.ПропускатьГруппы Тогда
			Текст = Текст + "
		|	И НЕ Элемент.ЭтоГруппа";
		КонецЕсли;
	Иначе
		Текст = 
		"ИЗ
		|	Справочник.СоставыКонвертаций КАК Состав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + Источник.ИмяСправочника + " КАК Элемент
		|		ПО Состав.ЭлементКонвертации = Элемент.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ Состав.ПометкаУдаления
		|	И НЕ Элемент.ПометкаУдаления";
		Если Источник.ПропускатьГруппы Тогда
			Текст = Текст + "
		|	И НЕ Элемент.ЭтоГруппа";
		КонецЕсли;
	КонецЕсли;
	
	Текст = Текст + "
	|	И Элемент." + ИмяПоля + " ПОДОБНО &Шаблон СПЕЦСИМВОЛ ""\""";
	Если ЗначениеЗаполнено(ИсключитьСсылку) Тогда
		Текст = Текст + "
	|	И Элемент.Ссылка <> &ИсключитьСсылку";
	КонецЕсли;
	Возврат Текст;
	
КонецФункции

Функция ТипСсылкиСправочника(ИмяСправочника)
	
	Возврат ТипЗнч(Справочники[ИмяСправочника].ПустаяСсылка());
	
КонецФункции

Функция ШаблонПодобия(СтрокаПоиска)
	
	Экранированная = СтрЗаменить(СтрокаПоиска, "\", "\\");
	Экранированная = СтрЗаменить(Экранированная, "%", "\%");
	Экранированная = СтрЗаменить(Экранированная, "_", "\_");
	Возврат "%" + Экранированная + "%";
	
КонецФункции

Функция ФрагментВхождения(Текст, СтрокаПоиска)
	
	ТекстВхождения = СтрЗаменить(Текст, Символы.ВК, "");
	Позиция = СтрНайти(НРег(ТекстВхождения), НРег(СтрокаПоиска));
	Если Позиция = 0 Тогда
		Возврат Новый Структура("НомерСтроки, Фрагмент", 0, "");
	КонецЕсли;
	
	ЛеваяЧасть = Лев(ТекстВхождения, Позиция - 1);
	НомерСтроки = СтрЧислоВхождений(ЛеваяЧасть, Символы.ПС) + 1;
	ПозицияРазрыва = СтрНайти(ЛеваяЧасть, Символы.ПС, НаправлениеПоиска.СКонца);
	НачалоСтроки = ?(ПозицияРазрыва = 0, 1, ПозицияРазрыва + 1);
	КонецСтроки = СтрНайти(ТекстВхождения, Символы.ПС, , Позиция);
	Если КонецСтроки = 0 Тогда
		Фрагмент = Сред(ТекстВхождения, НачалоСтроки);
	Иначе
		Фрагмент = Сред(ТекстВхождения, НачалоСтроки, КонецСтроки - НачалоСтроки);
	КонецЕсли;
	Фрагмент = СокрЛП(Фрагмент);
	Если СтрДлина(Фрагмент) > 300 Тогда
		Смещение = Позиция - НачалоСтроки + 1;
		ЛеваяГраница = Смещение - 80;
		Если ЛеваяГраница < 1 Тогда
			ЛеваяГраница = 1;
		КонецЕсли;
		Фрагмент = Сред(Фрагмент, ЛеваяГраница, 300);
	КонецЕсли;
	
	Возврат Новый Структура("НомерСтроки, Фрагмент", НомерСтроки, Фрагмент);
	
КонецФункции

Функция ИмяФормыПредопределенных(ТипКонвертации)
	
	Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
		Возврат "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXDTO";
	КонецЕсли;
	Возврат "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXML";
	
КонецФункции

Функция ИсточникиПоиска(КонвертацияXDTO)
	
	Источники = Новый Массив;
	Источники.Добавить(ИсточникКонвертации(КонвертацияXDTO));
	Источники.Добавить(ИсточникСостава(
		"ПравилаКонвертацииОбъектов",
		"Правило конвертации объектов",
		"Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента",
		ПоляПравилКонвертацииОбъектов(КонвертацияXDTO)));
	Источники.Добавить(ИсточникСостава(
		"ПравилаОбработкиДанных",
		"Правило обработки данных",
		"Справочник.ПравилаОбработкиДанных.Форма.ФормаЭлемента",
		ПоляПравилОбработкиДанных(КонвертацияXDTO)));
	Если Не КонвертацияXDTO Тогда
		ИсточникПредопределенных = ИсточникСостава(
			"ПравилаКонвертацииПредопределенныхДанных",
			"Правило конвертации предопределенных данных",
			"",
			ПоляПравилПредопределенныхДанных());
		ИсточникПредопределенных.ЧитатьТипКонвертации = Истина;
		Источники.Добавить(ИсточникПредопределенных);
		ИсточникСвойств = ИсточникСостава(
			"ПравилаКонвертацииСвойств",
			"Правило конвертации свойства",
			"Справочник.ПравилаКонвертацииСвойств.Форма.ФормаЭлемента",
			ПоляПравилКонвертацииСвойств());
		ИсточникСвойств.ЧерезВладельцаПравила = Истина;
		ИсточникСвойств.ЧитатьЭтоГруппа = Истина;
		ИсточникСвойств.ИмяФормыГруппы =
			Расш1_КонсольКодаКлиентСервер.ИмяФормыГруппыПравилаКонвертацииСвойств();
		Источники.Добавить(ИсточникСвойств);
	КонецЕсли;
	ИсточникАлгоритмов = ИсточникСостава(
		"Алгоритмы",
		"Алгоритм",
		"Справочник.Алгоритмы.Форма.ФормаЭлемента",
		ПоляАлгоритма());
	Источники.Добавить(ИсточникАлгоритмов);
	ИсточникЗапросов = ИсточникСостава(
		"Запросы",
		"Запрос",
		"Справочник.Запросы.Форма.ФормаЭлемента",
		ПоляЗапроса());
	ИсточникЗапросов.ПропускатьГруппы = Истина;
	Источники.Добавить(ИсточникЗапросов);
	Возврат Источники;
	
КонецФункции

Функция ИсточникКонвертации(КонвертацияXDTO)
	
	Источник = ИсточникСостава(
		"Конвертации",
		"Конвертация",
		"Справочник.Конвертации.Форма.ФормаЭлемента",
		ПоляКонвертации(КонвертацияXDTO));
	Источник.ЭтоКонвертация = Истина;
	Возврат Источник;
	
КонецФункции

Функция ИсточникСостава(ИмяСправочника, Вид, ИмяФормы, Поля)
	
	Источник = Новый Структура;
	Источник.Вставить("ИмяСправочника", ИмяСправочника);
	Источник.Вставить("Вид", Вид);
	Источник.Вставить("ИмяФормы", ИмяФормы);
	Источник.Вставить("Поля", Поля);
	Источник.Вставить("ЭтоКонвертация", Ложь);
	Источник.Вставить("ЧерезВладельцаПравила", Ложь);
	Источник.Вставить("ПропускатьГруппы", Ложь);
	Источник.Вставить("ЧитатьТипКонвертации", Ложь);
	Источник.Вставить("ЧитатьЭтоГруппа", Ложь);
	Источник.Вставить("ИмяФормыГруппы", "");
	Возврат Источник;
	
КонецФункции

Функция ПоляКонвертации(КонвертацияXDTO)
	
	Поля = Новый Массив;
	Если КонвертацияXDTO Тогда
		ДобавитьПоле(Поля, "АлгоритмПередКонвертацией", "Алгоритм перед конвертацией");
		ДобавитьПоле(Поля, "АлгоритмПередОтложеннымЗаполнением", "Алгоритм перед отложенным заполнением");
		ДобавитьПоле(Поля, "АлгоритмПослеКонвертации", "Алгоритм после конвертации");
		ДобавитьПоле(Поля, "АлгоритмПередОбработкойУдаления", "Алгоритм перед обработкой удаления");
		Возврат Поля;
	КонецЕсли;
	
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойДанных", "Алгоритм перед выгрузкой данных");
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойОбъекта", "Алгоритм перед выгрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПередЗагрузкойДанных", "Алгоритм перед загрузкой данных");
	ДобавитьПоле(Поля, "АлгоритмПередЗагрузкойОбъекта", "Алгоритм перед загрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПередКонвертациейОбъекта", "Алгоритм перед конвертацией объекта");
	ДобавитьПоле(Поля, "АлгоритмПередОтправкойИнформацииОбУдалении", "Алгоритм перед отправкой информации об удалении");
	ДобавитьПоле(Поля, "АлгоритмПередПолучениемИзмененныхОбъектов", "Алгоритм перед получением измененных объектов");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиДанных", "Алгоритм после выгрузки данных");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъекта", "Алгоритм после выгрузки объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиДанных", "Алгоритм после загрузки данных");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиОбъекта", "Алгоритм после загрузки объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиПараметров", "Алгоритм после загрузки параметров");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиПравилОбмена", "Алгоритм после загрузки правил обмена");
	ДобавитьПоле(Поля, "АлгоритмПослеПолученияИнформацииОбУзлахОбмена", "Алгоритм после получения информации об узлах обмена");
	ДобавитьПоле(Поля, "АлгоритмПриПолученииИнформацииОбУдалении", "Алгоритм при получении информации об удалении");
	Возврат Поля;
	
КонецФункции

Функция ПоляПравилКонвертацииОбъектов(КонвертацияXDTO)
	
	Поля = Новый Массив;
	Если КонвертацияXDTO Тогда
		ДобавитьПоле(Поля, "АлгоритмПриОтправкеДанных", "Алгоритм при отправке данных");
		ДобавитьПоле(Поля, "АлгоритмПередПолучениемДанных", "Алгоритм перед получением данных");
		ДобавитьПоле(Поля, "АлгоритмПриПолученииДанных", "Алгоритм при получении данных");
		ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиВсехДанных", "Алгоритм после загрузки всех данных");
		Возврат Поля;
	КонецЕсли;
	
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойОбъекта", "Алгоритм перед выгрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПриВыгрузкеОбъекта", "Алгоритм при выгрузке объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъекта", "Алгоритм после выгрузки объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъектаВФайлОбмена", "Алгоритм после выгрузки объекта в файл обмена");
	ДобавитьПоле(Поля, "АлгоритмПоследовательностьПолейПоиска", "Алгоритм последовательность полей поиска");
	ДобавитьПоле(Поля, "АлгоритмПередЗагрузкойОбъекта", "Алгоритм перед загрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПриЗагрузкеОбъекта", "Алгоритм при загрузке объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиОбъекта", "Алгоритм после загрузки объекта");
	Возврат Поля;
	
КонецФункции

Функция ПоляПравилОбработкиДанных(КонвертацияXDTO)
	
	Поля = Новый Массив;
	Если КонвертацияXDTO Тогда
		ДобавитьПоле(Поля, "АлгоритмПриОбработке", "Алгоритм при обработке");
		ДобавитьПоле(Поля, "АлгоритмВыборкаДанных", "Алгоритм выборка данных");
		Возврат Поля;
	КонецЕсли;
	
	ДобавитьПоле(Поля, "АлгоритмПередОбработкойПравила", "Алгоритм перед обработкой правила");
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойОбъекта", "Алгоритм перед выгрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъекта", "Алгоритм после выгрузки объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеОбработкиПравила", "Алгоритм после обработки правила");
	Возврат Поля;
	
КонецФункции

Функция ПоляПравилПредопределенныхДанных()
	
	Поля = Новый Массив;
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойОбъекта", "Алгоритм перед выгрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПриВыгрузкеОбъекта", "Алгоритм при выгрузке объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъекта", "Алгоритм после выгрузки объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиОбъектаВФайлОбмена", "Алгоритм после выгрузки объекта в файл обмена");
	ДобавитьПоле(Поля, "АлгоритмПередЗагрузкойОбъекта", "Алгоритм перед загрузкой объекта");
	ДобавитьПоле(Поля, "АлгоритмПриЗагрузкеОбъекта", "Алгоритм при загрузке объекта");
	ДобавитьПоле(Поля, "АлгоритмПослеЗагрузкиОбъекта", "Алгоритм после загрузки объекта");
	Возврат Поля;
	
КонецФункции

Функция ПоляПравилКонвертацииСвойств()
	
	Поля = Новый Массив;
	ДобавитьПоле(Поля, "АлгоритмПередВыгрузкойСвойства", "Алгоритм перед выгрузкой свойства");
	ДобавитьПоле(Поля, "АлгоритмПриВыгрузкеСвойства", "Алгоритм при выгрузке свойства");
	ДобавитьПоле(Поля, "АлгоритмПослеВыгрузкиСвойства", "Алгоритм после выгрузки свойства");
	ДобавитьПоле(Поля, "АлгоритмПередОбработкойВыгрузки", "Алгоритм перед обработкой выгрузки");
	ДобавитьПоле(Поля, "АлгоритмПослеОбработкиВыгрузки", "Алгоритм после обработки выгрузки");
	Возврат Поля;
	
КонецФункции

Функция ПоляАлгоритма()
	
	Поля = Новый Массив;
	ДобавитьПоле(Поля, "Алгоритм", "Алгоритм");
	Возврат Поля;
	
КонецФункции

Функция ПоляЗапроса()
	
	Поля = Новый Массив;
	ДобавитьПоле(Поля, "ТекстЗапроса", "Текст запроса");
	Возврат Поля;
	
КонецФункции

Процедура ДобавитьПоле(Поля, Имя, Синоним)
	
	Поле = Новый Структура;
	Поле.Вставить("Имя", Имя);
	Поле.Вставить("Синоним", Синоним);
	Поля.Добавить(Поле);
	
КонецПроцедуры

Функция ПредставлениеИсточникаПравил()
	
	Возврат НСтр("ru = 'Правила обмена'");
	
КонецФункции

Функция ПредставлениеИсточникаМодуля()
	
	Возврат НСтр("ru = 'Модуль конфигурации'");
	
КонецФункции

Функция ИмяФормыПросмотраМодуля()
	
	Возврат "ОбщаяФорма.Расш1_ПросмотрТекстаМодуля";
	
КонецФункции

Процедура ДополнитьМодулиКонфигурации(Результат, Конвертация, СтрокаПоиска, Шаблон)
	
	Если Результат.Обрезано Тогда
		Возврат;
	КонецЕсли;
	
	Релизы = РелизыКонвертации(Конвертация);
	Если Релизы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЛимитСтрок = ПределСтрокРезультата() - Результат.Строки.Количество() + 1;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(ЛимитСтрок, "ЧГ=0") + "
	|	Тексты.Релиз КАК Релиз,
	|	Тексты.Вид КАК Вид,
	|	Тексты.Ключ КАК Ключ,
	|	Тексты.Текст КАК Текст,
	|	ПРЕДСТАВЛЕНИЕ(Тексты.Релиз) КАК ПредставлениеРелиза,
	|	ПРЕДСТАВЛЕНИЕ(Тексты.Вид) КАК ПредставлениеВида
	|ИЗ
	|	РегистрСведений.Расш1_ТекстыМодулей КАК Тексты
	|ГДЕ
	|	Тексты.Релиз В (&Релизы)
	|	И Тексты.Текст ПОДОБНО &Шаблон СПЕЦСИМВОЛ ""\""";
	Запрос.УстановитьПараметр("Релизы", Релизы);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Результат.Строки.Количество() >= ПределСтрокРезультата() Тогда
			Результат.Обрезано = Истина;
			Прервать;
		КонецЕсли;
		ФрагментСтроки = ФрагментВхождения(Выборка.Текст, СтрокаПоиска);
		СтрокаРезультата = Результат.Строки.Добавить();
		СтрокаРезультата.ЭтоМодуль = Истина;
		СтрокаРезультата.Источник = ПредставлениеИсточникаМодуля();
		СтрокаРезультата.Вид = Выборка.ПредставлениеВида;
		СтрокаРезультата.Представление = Выборка.Ключ;
		СтрокаРезультата.СинонимПоля = Выборка.ПредставлениеРелиза;
		СтрокаРезультата.Релиз = Выборка.Релиз;
		СтрокаРезультата.ВидМодуля = Выборка.Вид;
		СтрокаРезультата.Ключ = Выборка.Ключ;
		СтрокаРезультата.ИмяПоля = "Текст";
		СтрокаРезультата.НомерСтроки = ФрагментСтроки.НомерСтроки;
		СтрокаРезультата.Фрагмент = ФрагментСтроки.Фрагмент;
		СтрокаРезультата.ИмяФормы = ИмяФормыПросмотраМодуля();
	КонецЦикла;
	
КонецПроцедуры

Функция РелизыКонвертации(Конвертация)
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Конвертация, "Конфигурация, КонфигурацияКорреспондент");
	Релизы = Новый Массив;
	Если ЗначениеЗаполнено(Реквизиты.Конфигурация) Тогда
		Релизы.Добавить(Реквизиты.Конфигурация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Реквизиты.КонфигурацияКорреспондент)
		И Релизы.Найти(Реквизиты.КонфигурацияКорреспондент) = Неопределено Тогда
		Релизы.Добавить(Реквизиты.КонфигурацияКорреспондент);
	КонецЕсли;
	Возврат Релизы;
	
КонецФункции

#КонецОбласти
